---
title: FootPrintRoof
classe: Autodesk.Revit.DB.FootPrintRoof
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.RoofBase
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# FootPrintRoof

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `CurtainGridSet CurtainGrids { get; }` | `footPrintRoof.CurtainGrids` | CurtainGridSet |
| `Boolean DefinesSlope { get; set; }` | `footPrintRoof.DefinesSlope` | Boolean |
| `Boolean ExtendIntoWall { get; set; }` | `footPrintRoof.ExtendIntoWall` | Boolean |
| `Double Offset { get; set; }` | `footPrintRoof.Offset` | Double |
| `Double Overhang { get; set; }` | `footPrintRoof.Overhang` | Double |
| `Double SlopeAngle { get; set; }` | `footPrintRoof.SlopeAngle` | Double |
| `ModelCurveArrArray GetProfiles()` | `footPrintRoof.GetProfiles()` | ModelCurveArrArray |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```